import 'package:carousel_slider/carousel_slider.dart';
import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';
import 'package:youtube_player_flutter/youtube_player_flutter.dart';

class AzkarPage extends StatefulWidget {
  @override
  _AzkarPagetate createState() => new _AzkarPagetate();
}

class _AzkarPagetate extends State<AzkarPage> {
  @override
  Widget build(BuildContext context) {
    return Scaffold(
        appBar: AppBar(
          leading: IconButton(
            icon: Icon(Icons.arrow_back_ios, color: Colors.white),
            onPressed: () => Navigator.of(context).pop(),
          ),
          title: Text(
            "الاذكار",
            style: GoogleFonts.reemKufi(fontSize: 18),
          ),
          flexibleSpace: Container(
            decoration: const BoxDecoration(
              gradient: LinearGradient(
                begin: Alignment.topRight,
                end: Alignment.bottomLeft,
                colors: [
                  Colors.pink,
                  Colors.purple,
                ],
              ),
            ),
          ),
        ),
        body: Stack(
          children: [
            Container(
              color: Color.fromARGB(255, 242, 242, 242),
              height: double.infinity,
            ),
            // Align(
            //   child: Container(
            //     child: Image.asset(
            //         "assets/app_images/bg_image.jpg" //Lottie.asset('assets/girlrecitingholyquran.json'),
            //         ),
            //     height: 950,
            //     margin: EdgeInsets.only(bottom: 0),
            //   ),
            //   alignment: Alignment.bottomCenter,
            // ),
            CarouselSlider(
                items: [
                  'الَّذِينَ آمَنُوا وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللَّهِ ۗ أَلَا بِذِكْرِ اللَّهِ تَطْمَئِنُّ الْقُلُوبُ',
                  "يَا أَيُّهَا الَّذِينَ آمَنُوا اذْكُرُوا اللَّهَ ذِكْرًا كَثِيرًا () وَسَبِّحُوهُ بُكْرَةً وَأَصِيلًا",
                  "وَالذَّاكِرِينَ اللَّهَ كَثِيرًا وَالذَّاكِرَاتِ أَعَدَّ اللَّهُ لَهُمْ مَغْفِرَةً وَأَجْرًا عَظِيمًا",
                  "يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّهَ إِلَّا قَلِيلًا",
                  'يقُولُ اللَّه تَعالى: أَنَا عِنْدَ ظَنِّ عَبْدِي بِي، وَأَنَا مَعهُ إِذَا ذَكَرَني، فَإن ذَكرَني في نَفْسهِ، ذَكَرْتُهُ في نَفسي، وإنْ ذَكَرَني في ملإٍ، ذكَرتُهُ في ملإٍ خَيْرٍ منْهُمْ'
                ].map((i) {
                  return Builder(
                    builder: (BuildContext context) {
                      return Container(
                          width: MediaQuery.of(context).size.width,
                          margin: EdgeInsets.all(5),
                          decoration: BoxDecoration(
                              color: Colors.white,
                              borderRadius: BorderRadius.circular(10)),
                          child: Center(
                              child: Container(
                            child: Text(
                              '$i',
                              textAlign: TextAlign.center,
                              style: GoogleFonts.reemKufi(fontSize: 18),
                            ),
                            padding: EdgeInsets.all(5),
                          )));
                    },
                  );
                }).toList(),
                options: CarouselOptions(
                  height: 150,
                  aspectRatio: 16 / 9,
                  viewportFraction: 0.8,
                  initialPage: 0,
                  enableInfiniteScroll: true,
                  reverse: false,
                  autoPlay: true,
                  autoPlayInterval: Duration(seconds: 8),
                  autoPlayAnimationDuration: Duration(milliseconds: 1000),
                  autoPlayCurve: Curves.fastOutSlowIn,
                  enlargeCenterPage: true,
                  // onPageChanged: callbackFunction,
                  scrollDirection: Axis.horizontal,
                )),
            Container(
              margin: EdgeInsets.only(top: 150),
              child: ListView.builder(
                itemCount: azkar.length,
                itemBuilder: (context, i) {
                  return Card(
                    child: ExpansionTile(
                        title: Text(
                          azkar[i].title,
                          style: GoogleFonts.elMessiri(
                            fontSize: 20.0,
                            fontWeight: FontWeight.w600,
                          ),
                        ),
                        children: items(azkar[i].zikr, context)),
                  );
                },
              ),
            )
          ],
        ));
  }
}

List<Widget> items(List<Zikr> _zikr, context) {
  List<Widget> myitems = [];
  for (var zikr in _zikr) {
    myitems.add(Container(
      child: Card(
        child: zikr.title != '2'
            ? Stack(
                children: [
                  Container(
                    width: MediaQuery.of(context).size.width - 50,
                    margin: EdgeInsets.fromLTRB(20, 5, 5, 10),
                    child: Text(
                      zikr.title != '2' ? zikr.contents : "",
                      style: GoogleFonts.amiriQuran(fontSize: 28,fontWeight: FontWeight.bold),
                      textAlign: TextAlign.right,
                    ),
                  ),
                  Card(
                      child: CounterView(
                    initNumber: zikr.count,
                  ))
                ],
              )
            : YoutubePlayer(
                controller: YoutubePlayerController(
                  initialVideoId: zikr.contents,
                  flags: const YoutubePlayerFlags(
                    autoPlay: false,
                    mute: false,
                  ),
                ),
                showVideoProgressIndicator: true,
                onReady: () {},
              ),
      ),
    ));
  }

  return myitems;
}

class CounterView extends StatefulWidget {
  final int? initNumber;

  CounterView({
    this.initNumber,
  });
  @override
  _CounterViewState createState() => _CounterViewState();
}

class _CounterViewState extends State<CounterView> {
  int _currentCount = 0;

  @override
  void initState() {
    _currentCount = widget.initNumber ?? 1;

    super.initState();
  }

  @override
  Widget build(BuildContext context) {
    return Container(
      padding: EdgeInsets.zero,
      decoration: BoxDecoration(
          // borderRadius: BorderRadius.circular(BorderRadiusMedium),
          // color: LightGreyColor,
          ),
      child: GestureDetector(
        child: Container(
          child: Text(
            _currentCount.toString(),
            style: GoogleFonts.cairo(fontSize: 22, fontWeight: FontWeight.bold),
          ),
          padding: const EdgeInsets.all(10),
        ),
        onTap: _dicrement,
      ),
    );
  }

  // void _increment() {
  //   setState(() {
  //     _currentCount != _currentCount! + 1;
  //     _counterCallback!(_currentCount);
  //     _increaseCallback!();
  //   });
  // }

  void _dicrement() {
    print("Clicked$_currentCount");
    setState(() {
      if (_currentCount! > 0) {
        _currentCount--;
      }
    });
  }

  Widget _createIncrementDicrementButton(IconData icon, onPressed) {
    return RawMaterialButton(
      materialTapTargetSize: MaterialTapTargetSize.shrinkWrap,
      constraints: BoxConstraints(minWidth: 32.0, minHeight: 32.0),
      onPressed: onPressed,
      elevation: 2.0,
      // fillColor: LightGreyColor,
      child: Icon(
        icon,
        // color: BlackColor,
        size: 12.0,
      ),
      shape: CircleBorder(),
    );
  }
}

class AZkar {
  final String title;
  List<Zikr> zikr = [];

  AZkar(this.title, this.zikr);
}

class Zikr {
  final String title;
  final String contents;
  final int count;

  Zikr(this.title, this.contents, this.count);
}

List<AZkar> azkar = [
  AZkar('اذكار الصباح', [
    Zikr(
        "title",
        '''أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ
 وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن 
ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ
 وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء 
وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا
 وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]. 
من قالها حين يصبح أجير من الجن حتى 
يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ''',
        1),
    Zikr(
        "title",
        '''
        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ
 يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. 
من قالها حين يصبح وحين
 يمسى كفته من كل شىء (الإخلاص والمعوذتين). ''',
        3),
    Zikr(
        "title",
        '''بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ،
 وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ 
ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. 
يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ''',
        3),
    Zikr(
        "title",
        '''بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ،
 إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ،
 ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ''',
        3),
    Zikr(
        "title",
        '''أَصْـبَحْنا وَأَصْـبَحَ المُـلْكُ لله وَالحَمدُ لله ،
         لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ،
         لهُ المُـلكُ ولهُ الحَمْـد، وهُوَ على كلّ شَيءٍ قدير ، 
        رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذا اليوم وَخَـيرَ ما بَعْـدَه 
        ، وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذا اليوم وَشَرِّ ما بَعْـدَه
        ، رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر 
        ، رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. 
''',
        1),
    Zikr(
        "title",
        '''
        اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ،
         خَلَقْتَنـي وَأَنا عَبْـدُك ،
         وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ،
          أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، 
        أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . 
من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.''',
        1),
    Zikr(
        "title",
        '''رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً
         وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. 
من قالها حين يصبح وحين يمسى كان حقا على الله
 أن يرضيه يوم القيامة.''',
        3),
    Zikr(
        "title",
        '''
       اللّهُـمَّ إِنِّـي أَصْبَـحْتُ أُشْـهِدُك ، 
       وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ،
        وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ،
         أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك 
         ، وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. 
من قالها أعتقه الله من النار.''',
        4),
    Zikr(
        "title",
        ''' اللّهُـمَّ ما أَصْبَـَحَ بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ، 
        فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ،
         فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. 
من قالها حين يصبح أدى شكر يومه.''',
        1),
    Zikr(
        "title",
        '''
        حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. 
من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.''',
        7),
    Zikr(
        "title",
        '''بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. 
لم يضره من الله شيء.''',
        3),
    Zikr(
        "title",
        ''' اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ،
         وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. ''',
        1),
    Zikr(
        "title",
        '''أَصْبَـحْـنا عَلَى فِطْرَةِ الإسْلاَمِ، 
        وَعَلَى كَلِمَةِ الإِخْلاَصِ،
         وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ، 
         وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ.''',
        1),
    Zikr(
        "title",
        '''
        سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ،
         وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ،
          وَمِـدادَ كَلِمـاتِـه. ''',
        3),
    Zikr(
        "title",
        '''
        اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ،
         اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. ''',
        3),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ،
         وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر 
         ، لا إلهَ إلاّ أَنْـتَ. ''',
        3),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ 
        في الدُّنْـيا وَالآخِـرَة ، 
        اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني 
        وَدُنْـيايَ وَأهْـلي وَمالـي ،
         اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ،
         اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ،
         وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.''',
        1),
    Zikr(
        "title",
        ''' يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ''',
        3),
    Zikr(
        "title",
        '''
أَصْبَـحْـنا وَأَصْبَـحْ المُـلكُ للهِ رَبِّ العـالَمـين ، 
اللّهُـمَّ إِنِّـي أسْـأَلُـكَ خَـيْرَ هـذا الـيَوْم
 ، فَـتْحَهُ ، وَنَصْـرَهُ ، وَنـورَهُ وَبَـرَكَتَـهُ ،
 وَهُـداهُ ، وَأَعـوذُ بِـكَ مِـنْ شَـرِّ ما فـيهِ وَشَـرِّ ما بَعْـدَه.''',
        1),
    Zikr(
        "title",
        '''اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ 
        فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، 
        أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ،
         أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ،
        
         وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.''',
        1),
    Zikr(
        "title",
        '''أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ''',
        3),
    Zikr(
        "title",
        '''اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. 
من صلى على حين يصبح وحين يمسى
 ادركته شفاعتى يوم القيامة.''',
        10),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، 
        وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ،
         وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ،
          وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ،
           وَقَهْرِ الرِّجَالِ.  ''',
        3),
    Zikr(
        "title",
        '''أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، 
        الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.  ''',
        3),
    Zikr(
        "title",
        '''يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ ,
         وَلِعَظِيمِ سُلْطَانِكَ.  ''',
        3),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا،
         وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا. ''',
        1),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ
         ، وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ''',
        3),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنِّي أَسْأَلُكَ عِلْمًا نَافِعًا، وَرِزْقًا طَيِّبًا، وَعَمَلًا مُتَقَبَّلًا.  ''',
        1),
    Zikr(
        "title",
        '''اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ،
         عَلَيْكَ تَوَكَّلْتُ ،
          وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ ,
         مَا شَاءَ اللَّهُ كَانَ ، 
         وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، 
         وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ,
          أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ، 
        وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا ,
         اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، 
        وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ،
         إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. ''',
        3),
    Zikr(
        "title",
        '''
        لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، 
        
        لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. 
كانت له عدل عشر رقاب،
 وكتبت له مئة حسنة،
  ومحيت عنه مئة سيئة، 
  وكانت له حرزا من الشيطان
''',
        100),
    Zikr(
        "title",
        '''سُبْحـانَ اللهِ وَبِحَمْـدِهِ. 
حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.
 لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاء
 َ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.

''',
        100),
    Zikr(
        "title",
        '''أسْتَغْفِرُ اللهَ وَأتُوبُ إلَيْهِ 
مائة حسنة، ومُحيت عنه مائة سيئة، 
وكانت له حرزاً من الشيطان حتى يمسى.
''',
        100),
    Zikr("2", 'yamVFrkHdEY', 1),
  ]),
  AZkar('اذكار المساء', [
    Zikr(
        "title",
        '''أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ 
كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِهِ
 لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ
 غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ نَفْسًا إِلَّا وُسْعَهَا لَهَا
  مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا لَا تُؤَاخِذْنَا
 إِنْ نَّسِينَآ أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا إِصْرًا كَمَا
  حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا
 مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا
  فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286]. 
من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه. ''',
        1),
    Zikr(
        "title",
        '''أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ
 وَلاَ نَوْمٌ لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن 
ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ
 وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء 
وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا
 وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255]. 
من قالها حين يصبح أجير من الجن حتى 
يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ''',
        1),
    Zikr(
        "title",
        '''
        بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ، ٱللَّهُ ٱلصَّمَدُ، لَمْ
 يَلِدْ وَلَمْ يُولَدْ، وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ. 
من قالها حين يصبح وحين
 يمسى كفته من كل شىء (الإخلاص والمعوذتين). ''',
        3),
    Zikr(
        "title",
        '''بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، مِن شَرِّ مَا خَلَقَ،
 وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، وَمِن شَرِّ 
ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ. 
يمسى ومن قالها حين يمسى أجير من الجن حتى يصبح. ''',
        3),
    Zikr(
        "title",
        '''بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ،
 إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ،
 ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ. ''',
        3),
    Zikr(
        "title",
        '''
        أَمْسَيْـنا وَأَمْسـى المـلكُ لله وَالحَمدُ لله ،
         لا إلهَ إلاّ اللّهُ وَحدَهُ لا شَريكَ لهُ، 
         لهُ المُـلكُ ولهُ الحَمْـد،
          وهُوَ على كلّ شَيءٍ قدير ،
         رَبِّ أسْـأَلُـكَ خَـيرَ ما في هـذهِ اللَّـيْلَةِ وَخَـيرَ ما بَعْـدَهـا ،
         وَأَعـوذُ بِكَ مِنْ شَـرِّ ما في هـذهِ اللَّـيْلةِ وَشَرِّ ما بَعْـدَهـا ،
         رَبِّ أَعـوذُبِكَ مِنَ الْكَسَـلِ وَسـوءِ الْكِـبَر ،
          رَبِّ أَعـوذُ بِكَ مِنْ عَـذابٍ في النّـارِ وَعَـذابٍ في القَـبْر. ''',
        1),
    Zikr(
        "title",
        '''
        اللّهـمَّ أَنْتَ رَبِّـي لا إلهَ إلاّ أَنْتَ ،
         خَلَقْتَنـي وَأَنا عَبْـدُك ،
         وَأَنا عَلـى عَهْـدِكَ وَوَعْـدِكَ ما اسْتَـطَعْـت ،
          أَعـوذُبِكَ مِنْ شَـرِّ ما صَنَـعْت ، 
        أَبـوءُ لَـكَ بِنِعْـمَتِـكَ عَلَـيَّ وَأَبـوءُ بِذَنْـبي فَاغْفـِرْ لي فَإِنَّـهُ لا يَغْـفِرُ الذُّنـوبَ إِلاّ أَنْتَ . 
من قالها موقنا بها حين يمسى ومات من ليلته دخل الجنة وكذلك حين يصبح.''',
        1),
    Zikr(
        "title",
        '''رَضيـتُ بِاللهِ رَبَّـاً وَبِالإسْلامِ ديـناً
         وَبِمُحَـمَّدٍ صلى الله عليه وسلم نَبِيّـاً. 
من قالها حين يصبح وحين يمسى كان حقا على الله
 أن يرضيه يوم القيامة.''',
        3),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنِّـي أَمسيتُ أُشْـهِدُك ،
         وَأُشْـهِدُ حَمَلَـةَ عَـرْشِـك ، 
         وَمَلَائِكَتَكَ ، وَجَمـيعَ خَلْـقِك ، 
        أَنَّـكَ أَنْـتَ اللهُ لا إلهَ إلاّ أَنْـتَ وَحْـدَكَ لا شَريكَ لَـك ،
         وَأَنَّ ُ مُحَمّـداً عَبْـدُكَ وَرَسـولُـك. ''',
        4),
    Zikr(
        "title",
        '''
        اللّهُـمَّ ما أَمسى بي مِـنْ نِعْـمَةٍ أَو بِأَحَـدٍ مِـنْ خَلْـقِك ،
         فَمِـنْكَ وَحْـدَكَ لا شريكَ لَـك ،
          فَلَـكَ الْحَمْـدُ وَلَـكَ الشُّكْـر. 
من قالها حين يمسى أدى شكر يومه.
        ''',
        1),
    Zikr(
        "title",
        '''
        حَسْبِـيَ اللّهُ لا إلهَ إلاّ هُوَ عَلَـيهِ تَوَكَّـلتُ وَهُوَ رَبُّ العَرْشِ العَظـيم. 
من قالها كفاه الله ما أهمه من أمر الدنيا والأخرة.''',
        7),
    Zikr(
        "title",
        '''بِسـمِ اللهِ الذي لا يَضُـرُّ مَعَ اسمِـهِ شَيءٌ في الأرْضِ وَلا في السّمـاءِ وَهـوَ السّمـيعُ العَلـيم. 
لم يضره من الله شيء.''',
        3),
    Zikr(
        "title",
        ''' اللّهُـمَّ بِكَ أَصْـبَحْنا وَبِكَ أَمْسَـينا ،
         وَبِكَ نَحْـيا وَبِكَ نَمُـوتُ وَإِلَـيْكَ النُّـشُور. ''',
        1),
    Zikr(
        "title",
        '''
        أَمْسَيْنَا عَلَى فِطْرَةِ الإسْلاَمِ، وَعَلَى كَلِمَةِ الإِخْلاَصِ، 
        وَعَلَى دِينِ نَبِيِّنَا مُحَمَّدٍ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ،
         وَعَلَى مِلَّةِ أَبِينَا إبْرَاهِيمَ حَنِيفاً مُسْلِماً وَمَا كَانَ مِنَ المُشْرِكِينَ. ''',
        1),
    Zikr(
        "title",
        '''
        سُبْحـانَ اللهِ وَبِحَمْـدِهِ عَدَدَ خَلْـقِه ،
         وَرِضـا نَفْسِـه ، وَزِنَـةَ عَـرْشِـه ،
          وَمِـدادَ كَلِمـاتِـه. ''',
        3),
    Zikr(
        "title",
        '''
        اللّهُـمَّ عافِـني في بَدَنـي ، اللّهُـمَّ عافِـني في سَمْـعي ،
         اللّهُـمَّ عافِـني في بَصَـري ، لا إلهَ إلاّ أَنْـتَ. ''',
        3),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنّـي أَعـوذُ بِكَ مِنَ الْكُـفر ،
         وَالفَـقْر ، وَأَعـوذُ بِكَ مِنْ عَذابِ القَـبْر 
         ، لا إلهَ إلاّ أَنْـتَ. ''',
        3),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ 
        في الدُّنْـيا وَالآخِـرَة ، 
        اللّهُـمَّ إِنِّـي أسْـأَلُـكَ العَـفْوَ وَالعـافِـيةَ في ديني 
        وَدُنْـيايَ وَأهْـلي وَمالـي ،
         اللّهُـمَّ اسْتُـرْ عـوْراتي وَآمِـنْ رَوْعاتـي ،
         اللّهُـمَّ احْفَظْـني مِن بَـينِ يَدَيَّ وَمِن خَلْفـي وَعَن يَمـيني وَعَن شِمـالي ، وَمِن فَوْقـي ،
         وَأَعـوذُ بِعَظَمَـتِكَ أَن أُغْـتالَ مِن تَحْتـي.''',
        1),
    Zikr(
        "title",
        ''' يَا حَيُّ يَا قيُّومُ بِرَحْمَتِكَ أسْتَغِيثُ أصْلِحْ لِي شَأنِي كُلَّهُ وَلاَ تَكِلْنِي إلَى نَفْسِي طَـرْفَةَ عَيْنٍ. ''',
        3),
    Zikr(
        "title",
        '''
        أَمْسَيْنا وَأَمْسَى الْمُلْكُ للهِ رَبِّ الْعَالَمَيْنِ، 
        اللَّهُمَّ إِنَّي أسْأَلُكَ خَيْرَ هَذَه اللَّيْلَةِ فَتْحَهَا ونَصْرَهَا، 
        ونُوْرَهَا وبَرَكَتهَا،
         وَهُدَاهَا، وَأَعُوذُ بِكَ مِنْ شَرِّ مَا فيهِا وَشَرَّ مَا بَعْدَهَا. ''',
        1),
    Zikr(
        "title",
        '''اللّهُـمَّ عالِـمَ الغَـيْبِ وَالشّـهادَةِ 
        فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كـلِّ شَـيءٍ وَمَليـكَه ، 
        أَشْهَـدُ أَنْ لا إِلـهَ إِلاّ أَنْت ،
         أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي وَمِن شَـرِّ الشَّيْـطانِ وَشِرْكِهِ ،
        
         وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم.''',
        1),
    Zikr(
        "title",
        '''أَعـوذُ بِكَلِمـاتِ اللّهِ التّـامّـاتِ مِنْ شَـرِّ ما خَلَـق. ''',
        3),
    Zikr(
        "title",
        '''اللَّهُمَّ صَلِّ وَسَلِّمْ وَبَارِكْ على نَبِيِّنَا مُحمَّد. 
من صلى على حين يصبح وحين يمسى
 ادركته شفاعتى يوم القيامة.''',
        10),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنَّا نَعُوذُ بِكَ مِنْ أَنْ نُشْرِكَ بِكَ شَيْئًا نَعْلَمُهُ ، 
        وَنَسْتَغْفِرُكَ لِمَا لَا نَعْلَمُهُ. ''',
        3),
    Zikr(
        "title",
        '''اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ الْهَمِّ وَالْحَزَنِ، 
        وَأَعُوذُ بِكَ مِنْ الْعَجْزِ وَالْكَسَلِ،
         وَأَعُوذُ بِكَ مِنْ الْجُبْنِ وَالْبُخْلِ،
          وَأَعُوذُ بِكَ مِنْ غَلَبَةِ الدَّيْنِ،
           وَقَهْرِ الرِّجَالِ.  ''',
        3),
    Zikr(
        "title",
        '''أسْتَغْفِرُ اللهَ العَظِيمَ الَّذِي لاَ إلَهَ إلاَّ هُوَ، 
        الحَيُّ القَيُّومُ، وَأتُوبُ إلَيهِ.  ''',
        3),
    Zikr(
        "title",
        '''يَا رَبِّ , لَكَ الْحَمْدُ كَمَا يَنْبَغِي لِجَلَالِ وَجْهِكَ ,
         وَلِعَظِيمِ سُلْطَانِكَ.  ''',
        3),
    Zikr(
        "title",
        '''لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ،
         لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلِّ شَيْءِ قَدِيرِ. 
كانت له عدل عشر رقاب، 
وكتبت له مئة حسنة، 
ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان. ''',
        100),
    Zikr(
        "title",
        '''اللَّهُمَّ أَنْتَ رَبِّي لا إِلَهَ إِلا أَنْتَ ، عَلَيْكَ تَوَكَّلْتُ ،
         وَأَنْتَ رَبُّ الْعَرْشِ الْعَظِيمِ , 
        مَا شَاءَ اللَّهُ كَانَ ، وَمَا لَمْ يَشَأْ لَمْ يَكُنْ ، 
        وَلا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ الْعَلِيِّ الْعَظِيمِ ,
         أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ،
         وَأَنَّ اللَّهَ قَدْ أَحَاطَ بِكُلِّ شَيْءٍ عِلْمًا , 
        
        اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ شَرِّ نَفْسِي ، 
        وَمِنْ شَرِّ كُلِّ دَابَّةٍ أَنْتَ آخِذٌ بِنَاصِيَتِهَا ، 
        إِنَّ رَبِّي عَلَى صِرَاطٍ مُسْتَقِيمٍ. 
ذكر طيب. ''',
        1),
    Zikr(
        "title",
        '''سُبْحـانَ اللهِ وَبِحَمْـدِهِ. 
حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ.
 لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.
''',
        100),
    Zikr("2", 'rQnNno3Do60', 1),
  ]),
  AZkar('أذكار النوم', [
    Zikr(
        "title",
        '''بِاسْمِكَ رَبِّـي وَضَعْـتُ جَنْـبي ،
         وَبِكَ أَرْفَعُـه، فَإِن أَمْسَـكْتَ نَفْسـي فارْحَـمْها ،
          وَإِنْ أَرْسَلْتَـها فاحْفَظْـها بِمـا تَحْفَـظُ بِه عِبـادَكَ الصّـالِحـين. ''',
        1),
    Zikr(
        "title",
        '''
        اللّهُـمَّ إِنَّـكَ خَلَـقْتَ نَفْسـي وَأَنْـتَ تَوَفّـاهـا لَكَ ممَـاتـها وَمَحْـياها ، 
        إِنْ أَحْيَيْـتَها فاحْفَظْـها ، وَإِنْ أَمَتَّـها فَاغْفِـرْ لَـها .
         اللّهُـمَّ إِنَّـي أَسْـأَلُـكَ العـافِـيَة. ''',
        1),
    Zikr("title", '''بِاسْـمِكَ اللّهُـمَّ أَمـوتُ وَأَحْـيا. ''', 1),
    Zikr(
        "title",
        '''الـحَمْدُ للهِ الَّذي أَطْـعَمَنا وَسَقـانا، وَكَفـانا،
     وَآوانا، فَكَـمْ مِمَّـنْ لا كـافِيَ لَـهُ وَلا مُـؤْوي.  ''',
        1),
    Zikr(
        "title",
        '''اللّهُـمَّ عالِـمَ الغَـيبِ وَالشّـهادةِ
         فاطِـرَ السّماواتِ وَالأرْضِ رَبَّ كُـلِّ شَـيءٍ وَمَليـكَه،
     أَشْهـدُ أَنْ لا إِلـهَ إِلاّ أَنْت،
     أَعـوذُ بِكَ مِن شَـرِّ نَفْسـي، وَمِن شَـرِّ الشَّيْـطانِ وَشِـرْكِه،
     وَأَنْ أَقْتَـرِفَ عَلـى نَفْسـي سوءاً أَوْ أَجُـرَّهُ إِلـى مُسْـلِم .  ''',
        1),
    Zikr(
        "title",
        '''اللّهُـمَّ أَسْـلَمْتُ نَفْـسي إِلَـيْكَ،
     وَفَوَّضْـتُ أَمْـري إِلَـيْكَ،
         وَوَجَّـهْتُ وَجْـهي إِلَـيْكَ، 
        وَأَلْـجَـاْتُ ظَهـري إِلَـيْكَ،
     رَغْبَـةً وَرَهْـبَةً إِلَـيْكَ،
     لا مَلْجَـأَ وَلا مَنْـجـا مِنْـكَ إِلاّ إِلَـيْكَ، 
    
    آمَنْـتُ بِكِتـابِكَ الّـذي أَنْزَلْـتَ وَبِنَبِـيِّـكَ الّـذي أَرْسَلْـت.''',
        1),
    Zikr("title", '''سُبْحَانَ اللَّهِ. ''', 33),
    Zikr("title", '''الْحَمْدُ لِلَّهِ.  ''', 33),
    Zikr("title", '''اللَّهُ أَكْبَرُ.  ''', 34),
    Zikr(
        "title",
        '''يجمع كفيه ثم ينفث فيهما والقراءة 
    فيهم{قل هو الله أحد}و{
    قل أعوذ برب الفلق} و{قل أعوذ برب الناس} 
    ومسح ما استطاع من الجسد يبدأ
     بهما على رأسه ووجه وما أقبل من جسده. 
''',
        3),
    Zikr(
        "title",
        '''سورة البقرة: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
آمَنَ الرَّسُولُ بِمَا أُنْزِلَ إِلَيْهِ مِنْ رَبِّهِ وَالْمُؤْمِنُونَ ۚ 
كُلٌّ آمَنَ بِاللَّهِ وَمَلَائِكَتِهِ وَكُتُبِهِ وَرُسُلِه
ِ لَا نُفَرِّقُ بَيْنَ أَحَدٍ مِنْ رُسُلِهِ ۚ وَقَالُوا سَمِعْنَا وَأَطَعْنَا ۖ 
غُفْرَانَكَ رَبَّنَا وَإِلَيْكَ الْمَصِيرُ. لَا يُكَلِّفُ اللَّهُ
 نَفْسًا إِلَّا وُسْعَهَا لَهَا مَا كَسَبَتْ وَعَلَيْهَا مَا اكْتَسَبَتْ رَبَّنَا
 لَا تُؤَاخِذْنَا إِنْ نَسِينَا أَوْ أَخْطَأْنَا رَبَّنَا وَلَا تَحْمِلْ عَلَيْنَا 
 إِصْرًا كَمَا حَمَلْتَهُ عَلَى الَّذِينَ مِنْ قَبْلِنَا رَبَّنَا وَلَا تُحَمِّلْنَا
 مَا لَا طَاقَةَ لَنَا بِهِ وَاعْفُ عَنَّا وَاغْفِرْ لَنَا وَارْحَمْنَا أَنْتَ مَوْلَانَا
  فَانْصُرْنَا عَلَى الْقَوْمِ الْكَافِرِينَ. [البقرة 285 - 286] 
من قرأ آيتين من آخر سورة البقرة في ليلة كفتاه.''',
        1),
    Zikr(
        "title",
        '''آية الكرسى: أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ

 لَّهُ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن
 ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ
  يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ

 إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [البقرة 255] 
أجير من الجن حتى يصبح.
''',
        1),
    Zikr(
        "title",
        '''أذكار من قلق في فراشه ولم ينم
عن بريدة رضي الله عنه، 

قال‏:‏ شكا خالد بن الوليد رضي الله عنه إلى النبي صلى الله عليه وسلم فقال‏:‏ 
يا رسول الله‏!‏ 

ما أنام الليل من الأرق، 
فقال النبي صلى الله عليه وسلم‏:‏ ‏"‏

إذا أويت إلى فراشك فقل‏:‏ اللهم رب السموات
 السبع وما أظلت، ورب الأرضين وما أقلت، 
ورب الشياطين وما أضلت،
 كن لي جارا من خلقك كلهم جميعا أن يفرط علي أحد منهم أو أن يبغي علي، عز جارك،
 وجل ثناؤك ولا إله غيرك، ولا إله إلا أنت‏"

عن عمرو بن شعيب، عن أبيه، عن جده: أن رسول الله صلى الله عليه وسلم كان يعلمهم من الفزع كلمات‏:‏ ‏"‏أعوذ بكلمات الله التامة من غضبه وشر عباده، ومن همزات الشياطين وأن يحضرون‏" ''',
        1),
    Zikr("2", 'GQL0CCkmed4', 1),
  ]),
  AZkar('أذكار الإستيقاظ من النوم', [
    Zikr(
        "title",
        '''
        الحَمْـدُ لِلّهِ الّذي أَحْـيانا بَعْـدَ ما أَماتَـنا وَإليه النُّـشور. 
        
        ''',
        1),
    Zikr(
        "title",
        '''الحمدُ للهِ الذي عافاني في جَسَدي وَرَدّ عَليّ روحي وَأَذِنَ لي بِذِكْرِه. 
        
        ''',
        1),
    Zikr(
        "title",
        '''لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شَـريكَ له، 
        لهُ المُلـكُ ولهُ الحَمـد، 
        وهوَ على كلّ شيءٍ قدير، سُـبْحانَ اللهِ،
         والحمْـدُ لله ،
         ولا إلهَ إلاّ اللهُ واللهُ أكبَر، وَلا حَولَ وَلا قوّة إلاّ باللّهِ العليّ العظيم. رَبِّ اغْفرْ لي. 
 
        
        ''',
        1),
    Zikr("2", 'wDvbtmZdK8I', 1),
  ]),
  AZkar('أذكار الأذان', [
    Zikr(
        "title",
        '''
         يقول مثل ما يقول المؤذن إلا في "حي على الصلاة ،
          وحي على الفلاح" فيقول "لا حول ولا قوة إلا بالله
        
        ''',
        1),
    Zikr(
        "title",
        ''' يقول " وأنا أشهد أن لا إله إلا الله ، 
        وحده لا شريك له ، 
        وأن محمد عبده ورسوله ، 
        رضيت بالله رباً ، 
        وبمحمداً رسولاً وبالإسلام ديناً"
         (( يقول ذلك عقب تشهد المؤذن))
        
        ''',
        1),
    Zikr("title", "يصلي على النبي صلى الله عليه وسلم بعد فراغه من إجابة المؤذن",
        1),
    Zikr(
        "title",
        '''
    اللهم رب هذه الدعوة التامة ،والصلاة القائمة،
     آت محمداً الوسيلة والفضيلة، 
     
     وأبعثه مقاماً محموداً الذي وعدته،
      [ إنك لا تخلف الميعاد ]''',
        1),
    Zikr(
        "title", "يدعو لنفسه بين الأذان والإقامة فإن الدعاء حينئذٍ لا يرد ", 1),
    Zikr("2", 'drXfYzCj6WM', 1),
  ]),
  AZkar('أذكار بعد السلام من الصلاة المفروضة', [
    Zikr(
        "title",
        '''
       أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله، أَسْـتَغْفِرُ الله.
اللّهُـمَّ أَنْـتَ السَّلامُ ، وَمِـنْكَ السَّلام ،
 تَبارَكْتَ يا ذا الجَـلالِ وَالإِكْـرام .
        ''',
        1),
    Zikr(
        "title",
        '''
        لا إلهَ إلاّ اللّهُ وحدَهُ لا شريكَ لهُ،
         لهُ المُـلْكُ ولهُ الحَمْد،
         وهوَ على كلّ شَيءٍ قَدير،
          اللّهُـمَّ لا مانِعَ لِما أَعْطَـيْت،
         وَلا مُعْطِـيَ لِما مَنَـعْت، 
         وَلا يَنْفَـعُ ذا الجَـدِّ مِنْـكَ الجَـد. 
        ''',
        1),
    Zikr(
        "title",
        '''
    لا إلهَ إلاّ اللّه, وحدَهُ لا شريكَ لهُ،
     لهُ الملكُ ولهُ الحَمد، 
    وهوَ على كلّ شيءٍ قدير، لا حَـوْلَ وَلا قـوَّةَ إِلاّ بِاللهِ، 
    لا إلهَ إلاّ اللّـه، وَلا نَعْـبُـدُ إِلاّ إيّـاه,
     لَهُ النِّعْـمَةُ وَلَهُ الفَضْل وَلَهُ الثَّـناءُ الحَـسَن، 
    لا إلهَ إلاّ اللّهُ مخْلِصـينَ لَـهُ الدِّينَ وَلَوْ كَـرِهَ الكـافِرون.''',
        1),
    Zikr("title", '''سُـبْحانَ الله . ''', 33),
    Zikr("title", '''  الحَمْـدُ لله  ''', 33),
    Zikr("title", ''' واللهُ أكْـبَر. ''', 33),
    Zikr(
        "title",
        '''
        لا إلهَ إلاّ اللّهُ وَحْـدَهُ لا شريكَ لهُ، 
        لهُ الملكُ ولهُ الحَمْد، وهُوَ على كُلّ شَيءٍ قَـدير.
        ''',
        1),
    Zikr(
        "title",
        '''
       بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ هُوَ ٱللَّهُ أَحَدٌ،
 ٱللَّهُ ٱلصَّمَدُ، لَمْ يَلِدْ وَلَمْ يُولَدْ،
  وَلَمْ يَكُن لَّهُۥ كُفُوًا أَحَدٌۢ.
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلْفَلَقِ، 
مِن شَرِّ مَا خَلَقَ، وَمِن شَرِّ غَاسِقٍ إِذَا وَقَبَ، 
وَمِن شَرِّ ٱلنَّفَّٰثَٰتِ فِى ٱلْعُقَدِ، 
وَمِن شَرِّ حَاسِدٍ إِذَا حَسَدَ.
بِسْمِ اللهِ الرَّحْمنِ الرَّحِيم
قُلْ أَعُوذُ بِرَبِّ ٱلنَّاسِ، مَلِكِ ٱلنَّاسِ،
 إِلَٰهِ ٱلنَّاسِ، مِن شَرِّ ٱلْوَسْوَاسِ ٱلْخَنَّاسِ، 
 ٱلَّذِى يُوَسْوِسُ فِى صُدُورِ ٱلنَّاسِ، مِنَ ٱلْجِنَّةِ وَٱلنَّاسِ.

        ''',
        3),
    Zikr(
        "title",
        '''أَعُوذُ بِاللهِ مِنْ الشَّيْطَانِ الرَّجِيمِ
اللّهُ لاَ إِلَـهَ إِلاَّ هُوَ الْحَيُّ الْقَيُّومُ
 لاَ تَأْخُذُهُ سِنَةٌ وَلاَ نَوْمٌ لَّهُ مَا فِي 
السَّمَاوَاتِ وَمَا فِي الأَرْضِ مَن ذَا الَّذِي يَشْفَعُ عِنْدَهُ إِلاَّ بِإِذْنِهِ يَعْلَمُ مَا بَيْنَ أَيْدِيهِمْ
 وَمَا خَلْفَهُمْ وَلاَ يُحِيطُونَ بِشَيْءٍ مِّنْ عِلْمِهِ إِلاَّ بِمَا شَاء وَسِعَ كُرْسِيُّهُ السَّمَاوَاتِ 
وَالأَرْضَ وَلاَ يَؤُودُهُ حِفْظُهُمَا وَهُوَ الْعَلِيُّ الْعَظِيمُ. [آية الكرسى - البقرة 255] 
        ''',
        1),
    Zikr(
        "title",
        '''
      لا إلهَ إلاّ اللّهُ وحْـدَهُ لا شريكَ لهُ،
       لهُ المُلكُ ولهُ الحَمْد، 
       يُحيـي وَيُمـيتُ وهُوَ على كُلّ شيءٍ قدير. 
عَشْر مَرّات بَعْدَ المَغْرِب وَالصّـبْح.
        ''',
        10),
    Zikr(
        "title",
        '''اللّهُـمَّ إِنِّـي أَسْأَلُـكَ عِلْمـاً نافِعـاً وَرِزْقـاً طَيِّـباً ،
         وَعَمَـلاً مُتَقَـبَّلاً. 
بَعْد السّلامِ من صَلاةِ الفَجْر.
        ''',
        1),
    Zikr(
        "title",
        '''
     اللَّهُمَّ أَجِرْنِي مِنْ النَّار. 
بعد صلاة الصبح والمغرب.
        ''',
        7),
    Zikr(
        "title",
        '''
   اللَّهُمَّ أَعِنِّي عَلَى ذِكْرِكَ وَشُكْرِكَ وَحُسْنِ عِبَادَتِكَ.
        ''',
        1),
  ]),
  AZkar('أذكار الصلاة', [
    Zikr(
        "title",
        '''
        
        أدعية استفتاح الصلاة
اللَّهُمَّ بَاعِدْ بَيْنِيْ وَبَيْنَ خَطَايَايَ 
كَمَا بَاعَدْتَ بَيْنَ الْمَشْرِقِ وَالْمَغْرِبِ، 
اللهم نَقِّنِيْ مِنْ خَطَايَايَ كَمَا يُنَقَّى الثَّوْبُ الْأبْيَضُ مِنَ الدَّنَسِ،
 اللهم اغْسِلْنِيْ مِنْ خَطَايَايَ،
 بِالثَّلْجِ وَالْمَاءِ والْبَرَدِ.
سُبْحَانَكَ سُبْحَانَكَ اللهم وَبِحَمْدِكَ،
 وَتَبَارَكَ اسْمُكَ، وَتَعَالَى جَدُّكَ،
  وَلَا إِلَهَ غَيْرُكَ.
الْحَمْدُ الْحَمْدُ للّهِ حَمْداً كَثِيراً طَيِّباً مُبَارَكاً فِيهِ.
اللهُ أكْبَرُ كَبِيْرًا،
 وَالْحَمْدُ لِلهِ كَثِيْرًا، وَسُبْحَانَ اللهِ بُكْرَةً وَّاصِيْلًا. 
أعُوْذُ بِاللهِ مِنَ الشَّيْطَانِ: مِنْ نَفْخِهِ، وَنَفْثِهِ، وَهَمْزِهِ.
اللَّهُمَّ رَبَّ جَبْرَائِيلَ، وَمِيْكَائِيلَ، وَإِسْرَافِيْلَ،
 فَاطِرَ السَّمَوَاتِ وَالْأرْضِ، عَالِمَ الغَيْبِ وَالشَّهَادَةِ أنْتَ تَحْكُمُ بَيْنَ عِبَادِكَ فِيْمَا كَانُوا فِيْهِ يَخْتَلِفُونَ،
 اِهْدِنِيْ لِمَا اخْتُلِفَ فِيْهِ مِنَ الْحَقِّ بِإِذْنِكَ إِنَّكَ تَهْدِيْ مَنْ تَشَاءُ إِلَى صِرَاطٍ مُّسْتَقِيْمٍ.
وَجَّهْتُ وَجْهِيَ لِلَّذِيْ فَطَرَ السَّمَوَاتِ وَالْأرْضَ حَنِيْفًا وَّمَا أنَا مِنَ الْمُشْرِكِيْنَ،
 إِنَّ صَلَاتِيْ، وَنُسُكِيْ، وَمَحْيَايَ، وَمَمَاتِيْ لِلهِ رَبِّ الْعَالَمِيْنَ،
 لَا شَرِيْكَ لَهُ وَبِذَلِكَ أُمِرْتُ وَانَا مِنَ الْمُسْلِمِيْنَ، اللهم أنْتَ الْمَلِكُ لَا إِلَهَ إِلَّا أنْتَ، أنْتَ رَبِّيْ وَأنَا عَبْدُكَ،
 ظَلَمْتُ نَفْسِيْ وَاعْتَرَفْتُ بِذَنْبِيْ فَاغْفِرْ لِيْ ذُنُوْبِيْ جَمِيْعًا إِنَّهُ لَا يَغْفِرُ الذُّنوبَ إِلَّا أنْتَ.
 وَاهْدِنِيْ لِأحْسَنِ الْأخْلَاقِ لَا يَهْدِيْ لِأحْسَنِهَا إِلَّا أنْتَ،
 وَاصْرِفْ عَنِّيْ سَيِّئَهَا، لَا يَصْرِفُ عَنِّيْ سَيِّئَهَا إِلَّا أنْتَ، لَبَّيْكَ وَسَعْدَيْكَ، وَالْخَيْرُ كُلُّهُ بِيَدَيْكَ،
 وَالشَّرُّ لَيْسَ إِلَيْكَ، أنَا بِكَ وَإِلَيْكَ، تَبارَكْتَ وَتَعَالَيْتَ، أسْتَغْفِرُكَ وَأتُوْبُ إِلَيْكَ.
        ''',
        1),
    Zikr(
        "title",
        '''
        أدعية الركوع
سُبْحانَ رَبِّيَ الْعَظِيْمِ. ثلاث مراتٍ أو أكثر.
سُبْحَانَ رَبِّيَ العَظِيمِ وَبِحَمْدِهِ. ثلاث مراتٍ.
سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.
سُبُّوُحٌ، قُدُّوسٌ، رَبُّ المَلَائِكَةِ وَالرُّوْحِ.
سُبْحَانَ ذِيْ الْجَبَرُوْتِ، وَالْمَلَكُوْتِ،
 وَالْكِبْرِيَاءِ، وَالْعَظَمَةِ.
اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ، وَلَكَ أَسْلَمْتُ،
 خَشَعَ لَكَ سَمْعِي وَبَصَرِي، وَمُخِّي وَعَظْمِي وَعَصَبِي.
  ''',
        1),
    Zikr(
        "title",
        '''
        
أدعية الرفع من الركوع
سَمِعَ اللهُ لِمَنْ حَمِدَهُ.
رَبَّنَا وَلَكَ الْحَمْدُ، حَمْدًا كَثِيْرًا طَيِّبًا مُبارَكًا فِيْهِ.
اللَّهُمَّ لَكَ رَكَعْتُ، وَبِكَ آمَنْتُ،
 وَلَكَ اسْلَمْتُ، خَشَعَ لَكَ سَمْعِيْ،
  و بَصَـرِيْ، وَمُخِّيْ، وَعَظْمِيْ، وَعَصَبِيْ،
   وَمَا استَقَلَّتْ بِهِ قَدَمِيْ لِلهِ رَبِّ الْعَالَمِيْنَ.
اللَّهُمَّ رَبَّنَا لَكَ الْحَمْدُ مِلْءَ السَّمَاوَاتِ وَمِلْءَ الْارْضِ،
 وَمَا بَيْنَهُمَا، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ، 
 أهْلَ الثَّنَاءِ وَالْمَجْدِ، أحَقُّ مَا قَالَ الْعَبْدُ،
 وَكُلُّنَا لَكَ عَبْدٌ، اللهم لَا مَانِعَ لِمَا أعْطَيْتَ،
  وَلَا مُعْطِيَ لِمَا مَنَعْتَ، وَلَا يَنْفَعُ ذَا الجَدِّ مِنْكَ الْجَدُّ.
اللَّهُمَّ لَكَ الْحَمْدُ مِلْءَ السَّمَاءِ،
 وَمِلْءَ الْارْضِ، وَمِلْءَ مَا شِئْتَ مِنْ شَيْءٍ بَعْدُ،
  اللَّهُمَّ طَهِّرْنِي بِالثَّلْجِ وَالْبَرَدِ،
 وَالْمَاءِ الْبَارِدِ، اللَّهُمَّ طَهِّرْنِي مِنَ الذُّنُوبِ وَالْخَطَايَا،
  كَمَا يُنَقَّى الثَّوْبُ الْابْيَضُ مِنَ الْوَسَخِ.
        ''',
        1),
    Zikr(
        "title",
        '''
    أدعية السجود
سُبْحَانَ رَبِّيَ الأَعْلَى. ثلاث مرات أو أكثر.
سُبْحَانَ رَبِّيَ الأعْلَى وَبِحَمْدِهِ. ثلاث مرات.
سُبُّوحٌ قُدُّوسٌ رَبُّ الْمَلاَئِكَةِ وَالرُّوحِ.
سُبحانَكَ اللّهمَّ ربَّنا وَبِحمدِكَ، اللّهمَّ اغفِرْ لي.
سُبْحَانَ ذِي الْجَبْرُوتِ وَالْمَلَكُوتِ وَالْكِبْرِيَاءِ وَالْعَظَمَةِ.
اللَّهُمَّ اغْفِرْ لِي ذَنْبِي كُلَّهُ دِقَّهُ وَجِلَّهُ، وَأَوَّلَهُ وَآخِرَهُ، وَعَلاَنِيَتَهُ وَسِرَّهُ.
اللَّهُمَّ لَكَ سَجَدْتُّ وَبِكَ آمَنْتُ، وَلَكَ أسْلَمْتُ، سَجَدَ وَجْهِي لِلَّذِيْ خَلَقَهُ، 
وَصَوَّرَهُ، وَشَقَّ سَمْعَهُ وَبَصَرَهُ، تَبَارَكَ اللهُ أحْسَنُ الْخَالِقيْنَ.
اللَّهُمَّ إِنِّيْ أعُوْذُ بِرِضَاكَ مِنْ سَخَطِكَ، وَبِمُعَافَاتِكَ مِنْ عُقوْبَتِكَ، وَأعُوْذُ بِكَ مِنْكَ،
 لَا أُحْصِـي ثَنَاءً عَلَيْكَ، أنْتَ كَمَا أثْنَيْتَ عَلَى نَفْسِكَ.
رَبِّ اعْطِ نَفْسِي تَقْوَاهَا زَكِّهَا أنْتَ خَيْرُ مَنْ زَكَّاهَا أنْتَ وَلِيُّهَا وَمَوْلَاهَا.
اللَّهُمَّ اجْعَلْ فِي قَلْبِي نُورًا وَاجْعَلْ فِيْ سَمْعِيْ نُورًا وَاجْعَلْ فِيْ بَصَرِيْ نُورًا وَاجْعَلْ مِنْ تَحْتِي نُورًا وَاجْعَلْ مِنْ فَوْقِي نُورًا وَعَنْ يَمِينِي نُورًا وَعَنْ يَسَارِي نُورًا وَاجْعَلْ أمَامِي نُورًا وَاجْعَلْ خَلْفِي نُورًا وَأعْظِمْ لِيْ نُورًا.
بعد أن يختار أحد أدعية السجود ، يسن له أن يدعوا بما شاء ،لأن "أَقْرَبُ مَا يَكُونُ الْعَبْدُ مِنْ رَبِّهِ وَهُوَ سَاجِدٌ، فَأَكْثِرُوا الدُّعَاءَ".
    
     ''',
        1),
    Zikr(
        "title",
        ''' أدعية الجلوس بين السجدتين
رَبِّ رَبِّ اغْفِرْ لِيْ، رَبِّ اغْفِرْ لِيْ.
اللَّهُمَّ اغْفِرْ لِيْ، وَارْحَمْنِيْ، وَاهْدِنِيْ، وَاجْبُرْنِيْ، وَعَافِنِيْ، وَارْزُقْنِيْ، وَارْفَعْنِيْ.
كان النبي صلى الله عليه وسلم يطيل هذا الركن بقدر السجود. ''',
        1),
    Zikr(
        "title",
        '''دعاء سجود التلاوة
سَجَدَ وَجْهِيَ للَّذِي خَلَقَهُ، وَشَقَّ سَمْعَهُ وبَصَرَهُ، بِحَوْلِهِ وَقُوَّتِهِ، فَتَبَارَكَ اللَّهُ أَحْسَنُ الْـخَالِقِينَ.
اللَّهُمَّ اكْتُبْ لِي بِهَا عِنْدَكَ أجْراً، وَضَعْ عَنِّي بِهَا وِزْرَاً، واْجعَلْهَا لِي عِنْدِكَ ذُخْراً، وتَقَبَّلَهَا مِنِّي كَمَا تَقَبَّلْتَهَا مِنْ عَبْدِكَ دَاوُدَ.
 ''',
        1),
    Zikr(
        "title",
        '''
        
        التشهد الأول
التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ
 أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ،
 أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.

 ''',
        1),
    Zikr(
        "title",
        '''
        
        التشهد الأخير
التَّحِيَّاتُ لِلَّهِ وَالصَّلَوَاتُ وَالطَّيِّبَاتُ السَّلَامُ عَلَيْكَ 
أَيُّهَا النَّبِيُّ وَرَحْمَةُ اللَّهِ وَبَرَكَاتُهُ السَّلَامُ عَلَيْنَا وَعَلَى عِبَادِ اللَّهِ الصَّالِحِينَ ، 
أَشْهَدُ أَنْ لَا إِلَهَ إِلَّا اللَّهُ وَأَشْهَدُ أَنَّ مُحَمَّدًا عَبْدُهُ وَرَسُولُهُ.
 اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ ،
 اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ.

        ''',
        1),
    Zikr(
        "title",
        '''
        أدعية بعد التشهد الأخير وقبل السلام
اللَّهُمَّ إِنِّيْ أعُوْذُ بِكَ مِنْ عَذَابِ الْقَبْرِ،
 وَمِنْ عَذَابِ جَهَنَّمَ،
  وَمِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ،
   وَمِنْ شَرِّ فِتْنَةِ الْمَسِيْحِ الدَّجَّالِ.
اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنْ عَذَابِ الْقَبْرِ. وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَسِيحِ الدَّجَّالِ.
 وَأَعُوذُ بِكَ مِنْ فِتْنَةِ الْمَحْيَا وَالْمَمَاتِ.
 اللَّهُمَّ إِنِّي أَعُوذُ بِكَ مِنَ الْمَأْثَمِ وَالْمَغْرَم ِ.
اللَّهُمَّ إِنِّي ظَلَمْتُ نَفْسِي ظُلْماً كَثِيراً ، وَلاَ يَغْفِرُ الذُّنُوبَ إِلاَّ أَنْتَ.
 فَاغْفِرْ لِي مَغْفِرَةً مِنْ عِنْدِكَ وَارْحَمْنِي، إِنَّكَ أَنْتَ الْغَفُورُ الرَّحِيمُ.
اللَّهُمَّ اغْفِرْ لِي مَا قَدَّمْتُ وَمَا أَخَّرْتُ. وَمَا أَسْرَرْتُ وَمَا أَعْلَنْتُ. وَمَا أَسْرَفْتُ. وَمَا أَنْتَ أَعْلَمُ بِهِ مِنِّي.
 أَنْتَ الْمُقَدِّمُ وَأَنْتَ الْمُؤَخِّرُ. لاَ إِلهَ إِلاَّ أَنْتَ.
رَبَّنَا آتِنَا فِي الدُّنْيَا حَسَنَةً وَفِي الآخِرَةِ حَسَنَةً وَقِنَا عَذَابَ النَّارِ.
اللَّهُمَّ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.
اللَّهُمَّ إِنِّيْ أسْألُكَ يَا أللهُ بِأنَّكَ الْوَاحِدُ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ،
 وَلَمْ يَكنْ لَهُ كُفُوًا أحَدٌ، أنْ تَغْفِرَ لِيْ ذُنُوْبِيْ إِنَّكَ أنْتَ الْغَفُوْرُ الرَّحِيْمُ.
اللَّهُمَّ حَاسِبْنِيْ حِسَابَاً يَسِيراً.
اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّ لَكَ الْحَمْدُ لَا إِلَهَ إِلَّا أنْتَ وَحْدَكَ لَا شَرِيْكَ لَكَ، الْمَنَّانُ،
 يَا بَدِيعَ السَّمَوَاتِ وَالْارْضِ يَا ذَا الْجَلَالِ وَالْإِكْرَامِ،
 يَا حَيُّ يَا قَيُّومُ إِنِّيْ أسْألُكَ الْجَنَّةَ وَأعُوْذُ بِكَ مِنَ النَّارِ.
اللَّهُمَّ إِنِّيْ أسْألُكَ بِأنَّيْ أشْهَدُ أنَّكَ أنْتَ اللهُ لَا إِلَهَ إِلَّا أنْتَ الْأحَدُ الصَّمَدُ الَّذِيْ لَمْ يَلِدْ وَلَمْ يُوْلَدْ وَلَمْ يَكُنْ لَهُ كُفُوًا أحَدٌ.
اللَّهُمَّ بِعِلْمِكَ الغَيْبَ وَقُدْرَتِكَ عَلَى الْخَلْقِ أحْيِنِيْ مَا عَلِمْتَ الْحَيَاةَ خَيْرًا لِيْ، وَتَوَفَّنِيْ إِذَا عَلِمْتَ الْوَفَاةَ خَيْرًا لِيْ، اللهم إِنِّيْ أسْألُكَ خَشْيَتَكَ فِيْ الْغَيْبِ وَالشَّهَادَةِ، وَأسْألُكَ كَلِمَةَ الْحَقِّ فِي الرِّضَا وَالْغَضَبِ، وَأسْألُكَ الْقَصْدَ فِيْ الْغِنَى وَالْفَقْرِ، وَأسْألُكَ نَعِيْمًا لَا يَنْفَدُ، وَأسْألُكَ قُرَّةَ عَيْنٍ لَا تَنْقَطِعُ، وَأسْألُكَ الرِّضَا بَعْدَ الْقَضَاءِ، وَأسْألُكَ بَرْدَ الْعَيْشِ بَعْدَ الْمَوْتِ، وَأسْألُكَ لَذَّةَ النَّظَرِ إِلَى وَجْهِكَ، وَالشَّوْقَ إِلَى لِقائِكَ فِيْ غَيْرِ ضَرَّاءَ مُضِرَّةٍ، وَلَا فِتْنَةٍ مُضِلَّةٍ، اللهم زَيِّنَّا بِزِينَةِ الْإِيْمَانِ، وَاجْعَلْنَا هُدَاةً مُهْتَدِيْنَ.

         ''',
        1),
    Zikr(
        "title",
        '''
        
        دعاء القنوت
اللَّهُمَّ اهْدِني فيمَنْ هدَيْت،
 وعَافِنِي فيمَنْ عافيتَ، وتَوَلَّني فيمن تَولَّيت، 
 وبارِك لي فيمَا أعطيت،
 وقِني شرَّ ما قَضَيْت، فإنَّك تقضي ولا يُقْضَى عَليك،
  إنَّه لا يَذلُّ من واليت،
  تباركت ربنا وتعاليت.
اللَّهُمَّ إني أعُوذُ بِرضَاك من سَخَطِك وأعُوذُ بمُعافاتك مِنْ عُقوبَتِك،
 وأعُوذُ بِكَ مِنْكَ لا أُحْصِي ثناءً عليكَ، أنْتَ كما أثنيت على نفسك.
اللَّهُمَّ إيَّاك نعبُدُ، ولك نُصلِّي ونسجُدُ، وإليك نسعَى ونَحْفِد، نرجُو رحمتك، ونخشى عذابَكَ، إنَّ عذابَكَ بالكافرين مُلْحِقٌ، اللَّهُمَّ إنَّا نستعينُكَ، ونستغفرك، ونُثْنِي عليكَ الخيرَ، ولا نَكْفُرُك، ونُؤمِنُ بِكَ ونَخْضَعُ لَك، ونَخْلَعُ من يكفُرُك.
اللَّهُمَّ تَقَبَّلْ مِنَّا إِنَّكَ أَنتَ السَّمِيعُ الْعَلِيمُ وَتُبْ عَلَيْنَآ إِنَّكَ أَنتَ التَّوَّابُ الرَّحِيمُ. وَصَلَّى اللهُ عَلَى سَيِّدِنَا مُحَمَّدٍ وَعَلى آلِهِ وَصَحْبِهِ وَسَلمَ.
دعاء القنوت يكون في الركعة الأخيرة من صلاة الوتر بعد الركوع ، وإذا جعله قبل الركوع فلا بأس ، إلا أنه بعد الركوع أفضل ، ويرفع يديه إلى صدره ولا يرفعها كثيراً . القنوت عند النوازل سنة في جميع الصلوات الخمس وهو في صلاة المغرب والفجر آكد.
        ''',
        1),
    Zikr(
        "title",
        '''
        
        دعاء خطبة الجمعة
ربناَّ لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة
 انك أنت الوهاب وأصلح اللهم أحوالنا في الأمور كلها وبلغنا 
بما يرضيك أمالنا واختم اللهم بالصالحات أعمالنا
 وبالسعادة أجالنا وتوفنا يا رب وأنت راض عنا.
اللَّهُمَّ اجعل جمعنا
 هذا جمعا مباركا مرحوما وتفرقنا من كل شر معصوما.
ربنا لا تدع لنا ذنبا إلا غفرته ولا هما إلا فرجته 
ولا مريضا إلا شفيته ولا ميتا إلا رحمته ولا طالبا 
أمرا من أمور الخير إلا سهلته له ويسرته.
اللَّهُمَّ وحد كلمة المسلمين واجمع شملهم واجعلهم 
يدا واحدة على من سواهم وانصر اللهم المسلمين واخذل
 الكفرة المشركين أعدائك أعداء الدين.
اللَّهُمَّ إنا نسألك لولاة أمورنا الصلاح والسداد.
اللَّهُمَّ كن لهم عونا وخذ بأيديهم إلى الحق والصواب والسداد والرشاد ووفقهم للعمل لما
 فيه رضاك وما فيه صالح العباد والبلاد.
اللَّهُمَّ إنا نسألك لبلدنا هذا اللهم اجعله بلدا ءامنا
 وارزقه من كل الخيرات وجنبه الفتن ما ظهر منها 
وما بطن وألف اللهم ما بين قلوبنا وبين قلوب أبناء هذا الوطن واجعلهم
 اللهم يا ربنا باسمك متحابين وعلى نصرة دينك متعاونين.
اللَّهُمَّ إنا نستعيذ بك من شر ما خلقت ومن كل عين حاسد و نسألك 
اللهم التوفيق والسداد والهداية والرشاد وحسن العقبى وحسن الميعاد.
اللَّهُمَّ أسبغ علينا نعمتك وعلى جميع المسلمين واملء اللهم قلوبنا 
بالإيمان والقناعة والزم جوارحنا العبادة والطاعة واغفر اللهم لنا ولوالدينا 
ولإخواننا وأشياخنا ولجميع من سبقنا بالإيمان واتنا من لدنك رحمة وهيئ لنا
 من امرنا رشدا واتنا ربنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار.
سبحان ربك رب العزة عما يصفون وسلام على المرسلين والحمد لله رب العالمين.

        ''',
        1),
  ]),
  AZkar("أذكار دخول وخروج الخلاء", [
    Zikr(
        "title",
        '''
  الذكر عند الخلاء
(بِسْمِ الله) اللّهُـمَّ إِنِّـي أَعـوذُ بِـكَ مِـنَ الْخُـبْثِ وَالْخَبائِث.
''',
        1),
    Zikr(
        "title",
        '''
        الذكر بعد الخروج من الخلاء
غُفْـرانَك. 
''',
        1),
  ]),
  AZkar("أذكار الطعام والشراب والضيف", [
    Zikr(
        "title",
        '''لذكر عند الطعام والشراب
بِسْمِ اللهِ.
فإنْ نسي في أَوَّلِهِ، فَليَقُلْ:
بِسْمِ اللَّه أَوَّلَهُ وَآخِرَهُ.
''',
        1),
    Zikr(
        "title",
        '''
        الذكر عند شرب اللبن
اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ.
''',
        1),
    Zikr(
        "title",
        '''
        الذكر عند شرب اللبن
اَللَّهُمَّ بَارِكْ لَنَا فِيهِ, وَزِدْنَا مِنْهُ.
''',
        1),
    Zikr(
        "title",
        '''الذكر عند الفراغ من الطعام والشراب
الْحَمْدُ للهِ الَّذِي أَطْعَمَنِي هَذَا, وَرَزَقَنِيهِ مِنْ غَيْرِ حَوْلٍ مِّنِّي وَلاَ قُوَّةٍ.
الْحَمْدُ لِلَّهِ كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ غَيْرَ مَكْفِيٍّ وَلَا مُوَدَّعٍ وَلَا مُسْتَغْنًى عَنْهُ رَبَّنَا. 
غُفِرَ لَهُ مَا تَقَدَّمَ مِنْ ذَنْبِهِ.
''',
        1),
    Zikr(
        "title",
        '''أذكار الضيف
أَفْطَرَ عِنْدَكُمُ الصَّائِمُونَ ، وَأَكَلَ طَعَامَكُمُ الأَبْرَارُ ، وَصَلَّتْ عَلَيْكُمُ الْمَلائِكَةُ. 
''',
        1),
    Zikr(
        "title",
        '''هدى النبى فى الشرب
كَانَ صَلَّى اللهُ عَلَيْهِ وَسَلَّمَ يَشْرَبُ فِي ثَلاَثَةِ أَنْفَاسٍ، إِذَا أَدْنَى الإِنَاءَ إِلَى فَمِهِ سَمَّى اللهَ تَعَالَى, وَإِذَا أَخَّرَهُ حَمِدَ اللهَ تَعَالَى، يَفْعَلُ ذَلِكَ ثَلاَثَ مَرَّاتٍ.
''',
        1),
  ]),
  AZkar("تسابيح", [
    Zikr(
        "title",
        '''
  سُبْحَانَ اللَّهِ 
يكتب له ألف حسنة أو يحط عنه ألف خطيئة.
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ اللَّهِ وَبِحَمْدِهِ 
حُطَّتْ خَطَايَاهُ وَإِنْ كَانَتْ مِثْلَ زَبَدِ الْبَحْرِ. لَمْ يَأْتِ أَحَدٌ يَوْمَ الْقِيَامَةِ بِأَفْضَلَ مِمَّا جَاءَ بِهِ إِلَّا أَحَدٌ قَالَ مِثْلَ مَا قَالَ أَوْ زَادَ عَلَيْهِ.
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ اللَّهِ وَالْحَمْدُ لِلَّهِ 
تَمْلَآَنِ مَا بَيْنَ السَّمَاوَاتِ وَالْأَرْضِ.
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ اللهِ العَظِيمِ وَبِحَمْدِهِ 
غرست له نخلة في الجنة (أى عدد)
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ اللَّهِ وَبِحَمْدِهِ ، سُبْحَانَ اللَّهِ الْعَظِيمِ 
ثقيلتان في الميزان حبيبتان إلى الرحمن (أى عدد).
''',
        100),
    Zikr(
        "title",
        '''لَا إلَه إلّا اللهُ وَحْدَهُ لَا شَرِيكَ لَهُ، لَهُ الْمُلْكُ وَلَهُ الْحَمْدُ وَهُوَ عَلَى كُلُّ شَيْءِ قَدِيرِ. 
كانت له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزا من الشيطان.
''',
        100),
    Zikr(
        "title",
        '''الْحَمْدُ للّهِ رَبِّ الْعَالَمِينَ 
تملأ ميزان العبد بالحسنات
''',
        100),
    Zikr(
        "title",
        '''لا حَوْلَ وَلا قُوَّةَ إِلا بِاللَّهِ 
كنز من كنوز الجنة (أى عدد).

''',
        100),
    Zikr(
        "title",
        '''الْلَّهُم صَلِّ وَسَلِم وَبَارِك عَلَى سَيِّدِنَا مُحَمَّد 
من صلى على حين يصبح وحين يمسى ادركته شفاعتى يوم القيامة.
''',
        100),
    Zikr(
        "title",
        '''أستغفر الله 
لفعل الرسول صلى الله عليه وسلم.
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ الْلَّهِ، وَالْحَمْدُ لِلَّهِ، وَلَا إِلَهَ إِلَّا الْلَّهُ، وَالْلَّهُ أَكْبَرُ 
أنهن أحب الكلام الى الله، ومكفرات للذنوب، وغرس الجنة، وجنة لقائلهن من النار، وأحب الى النبي عليه السلام مما طلعت عليه الشمس، والْبَاقِيَاتُ الْصَّالِحَات.
''',
        100),
    Zikr(
        "title",
        '''لَا إِلَهَ إِلَّا اللَّهُ 
أفضل الذكر لا إله إلاّ الله.
''',
        100),
    Zikr(
        "title",
        '''الْلَّهُ أَكْبَرُ 
من قال الله أكبر كتبت له عشرون حسنة وحطت عنه عشرون سيئة. الله أكبر من كل شيء.
''',
        100),
    Zikr(
        "title",
        '''سُبْحَانَ اللَّهِ ، وَالْحَمْدُ لِلَّهِ ، وَلا إِلَهَ إِلا اللَّهُ ، وَاللَّهُ أَكْبَرُ ، اللَّهُمَّ اغْفِرْ لِي ، اللَّهُمَّ ارْحَمْنِي ، اللَّهُمَّ ارْزُقْنِي. 
خير الدنيا والآخرة 
''',
        100),
    Zikr(
        "title",
        '''الْحَمْدُ لِلَّهِ حَمْدًا كَثِيرًا طَيِّبًا مُبَارَكًا فِيهِ. 
قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ ‏"‏لَقَدْ رَأَيْتُ اثْنَيْ عَشَرَ مَلَكًا يَبْتَدِرُونَهَا، أَيُّهُمْ يَرْفَعُهَا"‏.
''',
        100),
    Zikr(
        "title",
        '''اللَّهُ أَكْبَرُ كَبِيرًا ، وَالْحَمْدُ لِلَّهِ كَثِيرًا ، وَسُبْحَانَ اللَّهِ بُكْرَةً وَأَصِيلاً. 
قَالَ النَّبِيُّ صَلَّى اللَّهُ عَلَيْهِ وَسَلَّمَ "عَجِبْتُ لَهَا ، فُتِحَتْ لَهَا أَبْوَابُ السَّمَاءِ".
''',
        100),
    Zikr(
        "title",
        '''اللَّهُمَّ صَلِّ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا صَلَّيْتَ عَلَى إِبْرَاهِيمَ , وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ , اللَّهُمَّ بَارِكْ عَلَى مُحَمَّدٍ وَعَلَى آلِ مُحَمَّدٍ كَمَا بَارَكْتَ عَلَى إِبْرَاهِيمَ وَعَلَى آلِ إِبْرَاهِيمَ إِنَّكَ حَمِيدٌ مَجِيدٌ. 
في كل مره تحط عنه عشر خطايا ويرفع له عشر درجات ويصلي الله عليه عشرا وتعرض على الرسول صلى الله عليه وسلم (أى عدد).
''',
        100),
  ])
];
